Revit 2027 API
ContourSetting.IsItemEnabled Method
 Check if a ContourSettingItem is enabled
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsItemEnabled(
	ContourSettingItem item
)
Public Function IsItemEnabled (
	item As ContourSettingItem
) As Boolean
public:
bool IsItemEnabled(
	ContourSettingItem^ item
)
member IsItemEnabled :
        item : ContourSettingItem -> bool
Parameters
item ContourSettingItem
 The contour setting item.
Return Value
Boolean
 True if the item is enabled, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ContourSetting Class
Autodesk.Revit.DB Namespace